app/controllers/school_classes_controller.rb

  def create
    @class = SchoolClass.new(class_params)
    @class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Chemistry "], ["room_number", 23456543], ["created_at", "2019-09-25 19:50:08.545608"], ["updated_at", "2019-09-25 19:50:08.545608"]]

  def update
    set_school_class
    @class = SchoolClass.update(class_params)
---
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 1234], ["updated_at", "2019-09-25 19:58:22.698456"], ["id", 7]]

  def set_school_class
    @class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]