app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "David"], ["last_name", "Stoll"], ["created_at", "2019-09-25 17:46:03.838836"], ["updated_at", "2019-09-25 17:46:03.838836"]]
---
  def create
    @student = Student.new(student_params)
    # @student.first_name = params[:student][:first_name]
    # @student.last_name = params[:student][:last_name]
    # byebug
    @student.save